#include <iostream>
using namespace std;
#include <math.h>

int main() {
	setlocale(LC_ALL, "rus");
	int d, m;
	string day[20] { "Первое", "Второе", "Третье", "Четвёртое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одиннадцитое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое"};
	string smday[9] { "первое", "второе", "третье", "четвёртое", "пятое", "шестое", "седьмое", "восьмое", "девятое"};
	string month[12] { "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"};
	cout << "Введите день и номер месяца: ";
	cin >> d >> m;
	
	if (d < 21){
	    cout << day[d-1] << " ";
	}
	else{
	    if (d < 30){
	        cout << "Двадцать " << smday[d-21] << " ";
	    }
	    else{
	        if (d == 30){
	            cout << "Тридцатое ";
	        }
	        else {
	            cout << "Тридцать Первое ";
	        }
	    }
	}
	
	cout << month[m-1];
	return 0;
}
	