#include <iostream>
using namespace std;

int main()
{
    setlocate(LC, "rus");
    string cent[9] {"Сто", "Двести", "Триста", "Четыреста", "Пятьсот", "Шестьсот", "Семьсот", "Восемьсот", "Девятьсот"};
    string dec[8] {"двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    string dop[9] {"одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    string num[9] {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    int n;
    
    cin >> n;
    
    cout << cent[n/100 - 1] << " ";
    
    if (n%100 < 20){
        cout << dop[n%10 - 1];
    }
    else{
        cout << dec[(n%100)/10 - 2] << " " << num[n%10 - 1];
    }

    return 0;
}
